Revit 2026 API

# ConnectorConnectTo Method

---

Make connection between two connectors.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void ConnectTo(
	Connector connector
)
```
```vb
Public Sub ConnectTo (
	connector As Connector
)
```
```cpp
public:
void ConnectTo(
	Connector^ connector
)
```
```fsharp
member ConnectTo :
        connector : Connector -> unit
```

#### Parameters

connector Connector
    Indicate the connector will be connected to.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when argument is . |
| ArgumentException | Argument is invalid. |
| InvalidOperationException | Thrown when two connectors with different domain types. Thrown when these two connectors fail to connect each other. Thrown when connection already exists. |

Connection success may create a new Fitting between two connectors, if necessary.

#### Reference

Connector Class

Autodesk.Revit.DB Namespace